import json
import asyncio
from typing import Literal
from httpx import AsyncClient, HTTPError

AMBR = {
    '圣遗物列表': 'https://api.ambr.top/v2/chs/reliquary',
    '角色列表': 'https://api.ambr.top/v2/chs/avatar',
    '武器列表': 'https://api.ambr.top/v2/chs/weapon'
}


async def query_ambr(
    type: Literal['圣遗物列表', '角色列表', '武器列表'], retry: int = 3
) -> dict:
    '''安柏计划数据接口请求'''

    async with AsyncClient() as client:
        while retry:
            try:
                res = await client.get(AMBR[type], timeout=10.0)
                return res.json()['data']
            except (HTTPError or json.decoder.JSONDecodeError or KeyError):
                print(f'安柏计划 {type} 接口请求出错，正在重试...')
                retry -= 1
                if retry:
                    await asyncio.sleep(2)
    return {}


async def get_list(type: Literal['圣遗物列表', '角色列表', '武器列表']) -> list:
    res = await query_ambr(type)
    _dict = res['items']
    _list = []

    for values in _dict.values():
        if values['name'] != '':
            _list.append(values['name'])
    # print(_list)
    return _list


# async def main():

#     artifact_list = await get_list('圣遗物列表')
#     print(artifact_list)
#     char_list = await get_list('角色列表')
#     print(char_list)
#     weapon_list = await get_list('武器列表')
#     print(weapon_list)


# asyncio.run(main())

# ['行者之心', '勇士之心', '守护之心', '奇迹', '战狂', '武人', '教官', '赌徒', '流放者', '冒险家', '幸运儿', '学士', '游医', '冰风迷
# 途的勇士', '平息鸣雷的尊者', '渡过烈火的贤人', '被怜爱的少女', '角斗士的终幕礼', '翠绿之影', '流浪大地的乐团', '如雷的盛怒', '炽烈
# 的炎之魔女', '昔日宗室之仪', '染血的骑士道', '祭火之人', '祭水之人', '祭雷之人', '祭冰之人', '悠古的磐岩', '逆飞的流星', '沉沦之心
# ', '千岩牢固', '苍白之火', '追忆之注连', '绝缘之旗印', '华馆梦醒形骸记', '海染砗磲', '辰砂往生录', '来歆余响', '深林的记忆', '饰金
# 之梦', '沙上楼阁史话', '乐园遗落之花']

# ['神里绫华', '琴', '丽莎', '芭芭拉', '凯亚', '迪卢克', '雷泽', '安柏', '温迪', '香菱', '北斗', '行秋', '魈', '凝光', '可莉', '钟离
# ', '菲谢尔', '班尼特', '达达利亚', '诺艾尔', '七七', '重云', '甘雨', '阿贝多', '迪奥娜', '莫娜', '刻晴', '砂糖', '辛焱', '罗莎莉亚
# ', '胡桃', '枫原万叶', '烟绯', '宵宫', '托马', '优菈', '雷电将军', '早柚', '珊瑚宫心海', '五郎', '九条裟罗', '荒泷一斗', '八重神子
# ', '鹿野院平藏', '夜兰', '埃洛伊', '申鹤', '云堇', '久岐忍', '神里绫人', '柯莱', '多莉', '提纳里', '妮露', '赛诺', '坎蒂丝', '纳西
# 妲', '莱依拉', '流浪者', '珐露珊', '瑶瑶', '艾尔海森', '旅行者', '旅行者', '旅行者', '旅行者', '旅行者', '旅行者', '旅行者', '旅行
# 者']

# ['无锋剑', '银剑', '冷刃', '黎明神剑', '旅行剑', '暗铁剑', '吃虎鱼刀', '飞天御剑', '西风剑', '笛剑', '祭礼剑', '宗室长剑', '匣里龙
# 吟', '试作斩岩', '铁蜂刺', '黑岩长剑', '黑剑', '暗巷闪光', '降临之剑', '腐殖之剑', '天目影打刀', '辰砂之纺锤', '笼钓瓶一心', '原木
# 刀', '西福斯的月光', '东花坊时雨', '风鹰剑', '天空之刃', '苍古自由之誓', '斫峰之刃', '磐岩结绿', '雾切之回光', '波乱月白经津', '圣
# 显之钥', '裁叶萃光', '训练大剑', '佣兵重剑', '铁影阔剑', '沐浴龙血的剑', '白铁大剑', '以理服人', '飞天大御剑', '西风大剑', '钟剑', '祭礼大剑', '宗室大剑', '雨裁', '试作古华', '白影剑', '黑岩斩刀', '螭骨剑', '千岩古剑', '雪葬的星银', '衔珠海皇', '桂木斩长正', '玛海菈的水色', '恶王丸', '森林王器', '天空之傲', '狼的末路', '松籁响起之时', '无工之剑', '赤角石溃杵', '新手长枪', '铁尖枪', '白缨
# 枪', '钺矛', '黑缨枪', '匣里灭辰', '试作星镰', '流月针', '黑岩刺枪', '决斗之枪', '千岩长枪', '西风长枪', '宗室猎枪', '龙脊长枪', '赤沙之杖', '学徒笔记', '口袋魔导书', '魔导绪论', '讨龙英杰谭', '异世界行记', '翡玉法球', '甲级宝珏', '西风秘典', '流浪乐章', '祭礼
# 残章', '宗室秘法录', '匣里日月', '试作金珀', '万国诸海图谱', '黑岩绯玉', '昭心', '暗巷的酒与诗', '忍冬之果', '嘟嘟可故事集', '白辰
# 的回忆', '猎弓', '历练的猎弓', '鸦羽弓', '神射手之誓', '反曲弓', '弹弓', '信使', '西风猎弓', '绝弦', '祭礼弓', '宗室长弓', '弓藏', '试作澹月', '钢轮弓', '黑岩战弓', '苍翠猎弓', '暗巷猎手', '落霞', '幽夜华尔兹', '风花之颂', '破魔之弓', '掠食者', '曚云之月', '王
# 下近侍', '竭泽', '天空之翼', '阿莫斯之弓', '终末嗟叹之诗', '冬极白星', '若水', '飞雷之弦振', '猎人之径']